app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`content`, `created_at`, `name`, `updated_at`) VALUES ('Post this in the post section!!', '2012-09-07 03:29:18', 'Testing ', '2012-09-07 03:29:18')